{
    "BoardMembers": [
        {
            "id": "1",
            "name": "Isaac Sean",
            "image": "/board/Sean.jpeg",
            "title": "Founder and Chairperson",
            "description": "He holds a Bachelor's in Procurement and Chain Supply Management He brings expertise in procurement and supply chain management to the foundation. With a strong passion for creating opportunities for the marginalized, Isaac is a dedicated leader committed to making a positive impact in the community through collaborative efforts and strategic initiatives"
        },
        {
            "id": "2",
            "name": "Damiana Indoshi Amwayi",
            "image": "https://api.dicebear.com/7.x/notionists/svg?scale=200&seed=67890",
            "title": "Founder and Deputy Chairperson",
            "description": "She holds a Bachelor's in Food Nutrition and Dietetics Dedicated to serve and contribute to the society in ways that can help save life and needs of  people"
        },
        {
            "id": "3",
            "name": "Billia Chenamba Pusikwang",
            "image": "https://api.dicebear.com/7.x/notionists/svg?scale=200&seed=67890",
            "title": "Founder and Secretary",
            "description": "She holds a Bachelor of science in Agricultural Education and Extension Devoted to Initiate a smile on a face "
        },
        {
            "id": "4",
            "name": "Rev. Sr. Barbra Adongo",
            "image": "https://api.dicebear.com/7.x/notionists/svg?scale=200&seed=67890",
            "title": "Founder",
            "description": "Rev. Sr. Barbra Adongo together with the Franciscan Sisters of St. Joseph Asumbi (FSJ) and a Trustee of the Beacon of Compassion Charity Foundation (BCF). She is deeply committed to community Empowerment, focusing on educational and healthcare initiatives for vulnerable populations.With a degree in hospitality management, Rev. Sr. Barbra combines her organizational skills with a passion for community engagement. As a Trustee, she plays a key role in strategizing impactful programs that empower individuals and strengthen communities."
        },
        {
            "id": "5",
            "name": "Steve Odongo",
            "image": "/board/odongo.jpg",
            "title": "Founder and Finance Director",
            "description": "He holds a bachelors degree in law. Besides that, Steve is a professional mediator. He is driven by an unwavering passion for compassion and service to to others. His vision is rooted in creating meaningful change and fostering hope within the community through impactful and sustainable solutions."
        },
        {
            "id": "6",
            "name": "Mum Karola Teschler",
            "image": "https://api.dicebear.com/7.x/notionists/svg?scale=200&seed=67890",
            "title": "Founder and Executive Director",
            "description": "He holds a bachelors degree in law. Besides that, Steve is a professional mediator. He is driven by an unwavering passion for compassion and service to to others. His vision is rooted in creating meaningful change and fostering hope within the community through impactful and sustainable solutions."
        }
    ]
}
