{
    "TeamMembers": [
        {
            "id": "1",
            "name": "Isaac Sean",
            "image": "/board/Sean.jpeg",
            "title": "Chairperson",
            "description": "He holds a Bachelor's in Procurement and Chain Supply Management He brings expertise in procurement and supply chain management to the foundation. With a strong passion for creating opportunities for the marginalized, Isaac is a dedicated leader committed to making a positive impact in the community through collaborative efforts and strategic initiatives."
        },
        {
            "id": "2",
            "name": "Damiana Indoshi Amwayi",
            "image": "https://api.dicebear.com/7.x/notionists/svg?scale=200&seed=67890",
            "title": "Deputy Chairperson",
            "description": "She holds a Bachelor's in Food Nutrition and Dietetics Dedicated to serve and contribute to the society in ways that can help save life and needs of  people."
        },
        {
            "id": "3",
            "name": "Cynthia Cayte",
            "image": "/board/cayte.jpg",
            "title": "Secretary"
            
        },
        
        {
            "id": "4",
            "name": "Steve Odongo",
            "image": "/board/odongo.jpg",
            "title": "Finance Director",
            "description": "He holds a bachelors degree in law. Besides that, Steve is a professional mediator. He is driven by an unwavering passion for compassion and service to to others. His vision is rooted in creating meaningful change and fostering hope within the community through impactful and sustainable solutions."
        },
        {
            "id": "5",
            "name": "James otieno",
            "image": "/board/james.jpg",
            "title": "Communications Director",
            "description": "He is a strategic and result-driven communication leader with a strong background in digital media, public relations, and organizational branding. As Head of Communication at BCF, he oversees the foundation’s communication strategy, ensuring clarity, consistency, and impact across all platforms. Holding a degree in Computer Science, James combines technical expertise with creative storytelling to strengthen BCF’s digital presence and community engagement. His passion for innovation and effective communication continues to drive initiatives that amplify BCF’s mission and connect people to meaningful change."
        }
    ]
}
